{
  "button": {
    "delete": "Delete",
    "edit": "Edit",
    "add": "Add",
    "cancel": "Cancel",
    "import": "Upload (JSON)"
  },
  "menu": {
    "edit": "Edit",
    "delete":"Delete",
    "copy": "Make a copy",
    "download": "Download",
    "downloadExcel": "Download as Excel",
    "downloadJson": "Download as JSON",
    "deleteFeature": "Delete this feature",
    "addStakeholder": "Add a stakeholder",
    "addPrecondition": "Add a preconditon",
    "deletePrecondition": "Delete this preconditon",
    "addExample": "Add another situation",
    "deleteExample": "Delete this situation",
    "noExample": "No situation",
    "noStakeholder": "No stakeholders yet"
  },
  "toolbar": {
    "name": "EbA-UIM",
    "projects": "Projects",
    "method": "EbA Method Guide",
    "about": "About",
    "skipToMain": "Skip to main content"
  },
  "languages": {
    "est": "EST",
    "eng": "ENG"
  },
  "addProject": {
    "title": "New project",
    "input": "Project name",
    "placeholder": "Project name"
  },
  "projectsTable": {
    "title": "Projects",
    "seeMore": "Enter project ->",
    "sortByLastModified": "Last modified"
  },
  "deleteProjectModal": {
    "title": "Delete project: {{name}}",
    "body": "Are you sure you want to delete the project?"
  },
  "deleteFeatureGroupModal": {
    "title": "Delete feature group",
    "body": "Are you sure you want to delete the feature group?"
  },
  "deleteStakeholderModal": {
    "title": "Delete stakeholder",
    "body": "Are you sure you want to delete the stakeholder?"
  },
  "editProjectModal": {
    "title": "Edit project name",
    "input": "Project name"
  },
  "editFeatureGroupModal": {
    "title": "Edit feature group name",
    "input": "Feature group name"
  },
  "editStakeholderModal": {
    "title": "Edit stakeholder name",
    "input": "Stakeholder name"
  },
  "addGroup": {
    "title": "Add a new table tab",
    "list": "Existing table tabs",
    "input": "Table tab name",
    "placeholder": "Enter feature ID or abbreviation",
    "defaultTabName": "Tab 1"
  },
  "addStakeholder": {
    "title": "Add a new stakeholder",
    "list": "Existing stakeholders",
    "input": "Stakeholder name",
    "placeholder": "Enter the name in plural"
  },
  "table": {
    "newRow": "Add new row",
    "deleteRow": "Row deletion",
    "delete": "Delete",
    "edit": "Edit",
    "save": "Save",
    "cancelEdit": "Cancel editing",
    "deleteRowARIA": "Delete row"
  },
  "select": {
    "chooseOption": "Select",
    "yes": "Yes",
    "no": "No",
    "dontKnow": "Don't know",
    "partly": "Partly"
  },
  "methodCombinations": {
    "CHOOSE_OPTION": "Select",
    "YES": "Yes",
    "NO": "No",
    "DONT_KNOW": "Don't know",
    "PARTLY": "Partly"
  },
  "plan": {
    "": ""
  },
  "methodTabs":{
    "method": {
      "tab": "EbA Method Guide",
      "subtab": "Method",
      "subtab1": "Step 1",
      "subtab2": "Step 2",
      "subtab3": "Step 3",
      "subtab4": "Step 4",
      "subtab5": "Step 5",
      "subtab6": "Step 6",
      "subtab7": "Step 7",
      "subtab8": "NB"
    },
    "combinations": {
      "tab": "Combined answers",
      "subtab": "Combinations",
      "subtab1": "Interpretation"
    },
    "example": {
      "tab": "Example"
    }
  },
  "method": {
    "general": {
      "example": "Example"
    },
    "intro": {
      "title": "EbA Method",
      "header": "Experience-based Analysis (EbA) Method",
      "area": "What is the EbA method?<br></br>How to apply the EbA method?<br></br>What do you need to know when using the EbA method?",
      "text": "The Experience-based Analysis (EbA) method has been created to provide an early indication in the development of digital products or e-services (“product'“ hereafter) whether the solution will work and what the possible risks are, precisely from the point of view of user behaviour and habits, analysing usability in a broader sense. The EbA method draws conclusions about usability based on the expectations for stakeholders by product creators and accordingly the previous actions and experiences of stakeholders in similar situations. Decisions about future actions could be made based on past behaviour and circumstances of stakeholders, rather than asking users about their intentions (again) to act in a certain way. The purpose of EbA is to find out to what extent stakeholders have the expected knowledge, skills, habits, and means necessary for the success of the product. The EbA method is based on the premise that people usually behave according to experiential patterns.<br></br>The EbA method can be used for usability inspection as soon as a new solution is described. Using the EbA method, it is possible to get an idea of whether the product would work as such, or if it would be reasonable to change the requirements, or if some aspects should be analysed further. An early analysis provides an overview of the situation before the requirements are handed over for prototyping, user testing, and development. The information obtained from the analysis helps to improve the input for the next stages of development and to more consciously prepare for testing with users.  For EbA, solution descriptions can be statements about what users can do or have to do, user stories, use cases, scenarios,  process descriptions, general descriptions of the solution of the business analysis or from the strategy document, data from the journey map, or other similar input that describes the planned solution and the intended kinds of user.<br></br>EbA is intended to be used by the people who elicit the requirements. In addition to requirements engineers, the EbA method is also intended for product owners, business analysts, etc.<br></br>In summary, by the EbA method, requirement engineers should consider what they expect from stakeholders concerning each feature as preconditions of the feature. The holding of the preconditions is assessed based on similar situations that stakeholders have experienced in the past. The usability of the product is deduced by combining the information from a similar past situation with the precondition of the feature of the product under development. Based on the output, product creators or requirement engineers can create an action plan.<br></br>Figure 1 shows the framework of the EbA method. The figure shows the components required for the analysis and the process steps that the method user must take to obtain the result.",
      "text2": "In the EbA method, the description of the planned solution should be divided into features first. Then decide which stakeholders are involved in each feature and what skills, knowledge, attitudes, activities, and means are expected from the stakeholders within this specific feature to make the feature efficient. For each precondition, find an example of a situation that the stakeholder has experienced in the past. The example should correlate with the situation described in the precondition. For the next, validate to what extent the feature precondition and example situation match in terms of stakeholder and context, and evaluate whether the stakeholder's action in the comparable situation was purposeful and what was the stakeholder's satisfaction while doing so. The EbA method formulates a sentence indicating to what extent the stakeholder's actions correspond to the expectations mentioned in the preconditions. This sentence helps to decide whether the preconditions are met sufficiently for the solution to work successfully and is helpful for planning future actions. The EbA method is explained in more detail in the following steps."
    },
    "step1": {
      "header": "Step 1. Divide the description of the planned solution into features",
      "text": "Divide the solution of the product/e-service („product“ hereafter) into features and split each feature into a separate row (see Fig. 2). Each feature should represent one or more logically related solution capabilities that provide value to a stakeholder and support the purpose for which the product is being created. In addition to describing the interactions and the product itself, describe aspects that represent the product more generally. As a general description, you could describe the wider context of the product and its dependencies on other services and processes that the product under development is affecting or that affect your product. If you see that product principles expect some action or involvement of stakeholders, add product principle descriptions as features as well. For example, if it is meant that the new solution enables users to go through the process fast (in 15 minutes), then this purpose could be listed as a feature as well.",
      "example": "Let us assume that the platform of an e-service needs to be complemented so that the customers of the e-service could upload files onto the platform instead of sending them separately by e-mail. The product owner of the e-service expresses his opinion as follows: „The platform does not need to limit the format of the files customers upload because, anyway, customers use common software packages. However, the file to be uploaded should be limited to one file, and the file size can be up to 10 MB.“ As was stated above, in EbA this kind of requirement is viewed as a feature, which in this case can be formulated as follows. The customers of the e-service can upload one file with no format specified but a size limit of 10 MB.",
      "text2": "The EbA tool allows you to group features and change the name of the label by topic using the \"Add a new table tab\" function. When you start the analysis, the first tab has been created."
    },
    "step2": {
      "header": "Step 2. Decide which stakeholders are involved in the feature and what preconditions are expected from stakeholders within this specific featureDecide which stakeholders are involved in each feature and what skills, knowledge, attitudes, activities, and means are expected from stakeholders within this specific feature to make the feature efficient",
      "text": "Take a look at each feature and decide which stakeholders are involved in each feature, who takes an action on this feature, or are significantly affected by the feature. Analyse what skills, knowledge, attitudes, activities, resources, and means are expected from stakeholders as preconditions within this specific feature to make the feature efficient (see Fig. 3).<br></br>For example, what must the stakeholder do, know or be able to do as a precondition that the solution under development will create the result or value for which it is intended? Besides, think about preconditions that are not directly related to the product under development but either affect or are themselves significantly affected by the feature being analysed. When describing the preconditions, consider the aspects that you, as the creator of the product, have considered important. For example, such as emotional goals (how the stakeholder must feel while using the product), cyber security goals (what requirements they need to know or meet), or general goals of the product (what the product is created for, for example, to reduce the bureaucracy or to accelerate the process).<br></br>For Step 2 use the brainstorming method. For the EbA method, formulate the feature's preconditions in a supportive way.",
      "example": "In our running example, we had the feature „The customers of the e-service can upload one file with no format specified but a size limit of 10 MB“. The preconditions for this feature in our running example could be as follows:<ol><li><i>customers</i> upload attachments in a file format that the recipients of the files have software programmes to open;</li><li><i>recipients of the files</i> do not need to process the information in the file;</li><li><i>customers</i> know how to compress files without losing the quality of images;</li><li><i>customers</i> know how to compress all the information into one file;</li><li><i>customers</i> do not mind compressing all the information into one file.</li></ol>",
      "text2": "In the following steps, we will try to find out to what extent these preconditions are met. Using the EbA tool, you will be asked: <i>Do + Stakeholder + Feature precondition.</i>",
      "example2": "For example, in the EbA-UIM tool, precondition No. 1 is formulated as the following question: “Do + <i>customers</i> + upload attachments in a file format that the recipients of the files have software programmes to open?”"
  },
    "step3": {
      "header": "Step 3. For each precondition, find an example of a situation that the stakeholder has experienced in the past and correlates with the situation described in the precondition",
      "text": "Any activity, skill, attitude, presence of the means, use of devices, etc. indicated in the precondition, are expressed in some situations in some kind of behaviour. For each precondition, find the closest situation that the stakeholder has experienced in the past where the same behaviour of the stakeholder has appeared as described in the precondition (see Fig. 4). The example should correlate with the situation described in the precondition. The example does not necessarily have to be about a similar product, because when developing new solutions, we may not find previous examples about the same domain or feature. However, we could find examples of the situation included by the precondition, which is a smaller fragment of the feature. If a precisely correlating example cannot be found, a similar one can be found, which can also provide useful information for analysis. It is suitable to use the brainstorming method to obtain the examples.",
      "text2": "For example, if it is crucial for the feature to be successful that the stakeholder follows the agreed process in detail, find an example of a situation where the same stakeholder has had to follow the same process in detail previously. It would be great if you could find an example in which the context of previous experiences matches the context of the precondition. If you cannot find such an example that applies to the entire stakeholder group, then try to find an example that some of the stakeholder representatives have experienced; e.g., only some of them have had to follow the process in detail. If you cannot find one, bring an example experienced by another stakeholder for comparison, e.g., a different stakeholder who has been in a situation where they had to complete this process in detail. The experience of another stakeholder can also provide valuable information. The same recommendation applies to the context: if you cannot find an example that completely matches the context of the precondition, then give an example that is similar to the context, e.g., where the process is different, or there was no need to complete the process in detail, or the process used to take place on paper will now be digital. If it is difficult to find a similar context, try to find an example of another context, e.g., another process that the stakeholder has had to perform in the past, or for instance, if the feature and precondition are about a workplace situation, the example describes a non-workplace situation. A different context can also provide valuable information (see Step 6). You can describe multiple examples for one precondition. If no comparable example can be found, select \"No situation\".",
      "example": "In the running example, precondition No. 1 (<i>Customers upload attachments in a file format that the recipients of the files have software programmes to open</i>) is concerned with using software file formats, so that the example situation could be: “Currently, customers send files with email attachments that the recipients of the files have had to open on Windows computers.”"
    },
    "step4": {
      "header": "Step 4. Validate to what extent the precondition and example match, and evaluate the action of the stakeholders in the comparable situation",
      "text": "In Steps 4.1 and 4.2, you should validate to what extent the feature precondition and the example situation match in terms of stakeholder and context. In Steps 4.3 and 4.4 you should evaluate whether the stakeholder's action in the comparable situation was purposeful and what was the stakeholder's satisfaction while doing so. (See Fig. 5)",
      "text0": "The information for Step 4 can be obtained from various sources: user behaviour and feedback collected previously from service providers, published research results and statistics, research articles, opinions left on social media, and information synthesised by the requirement engineer based on public information and work experience.",
      "subheading1": "Step 4.1. The same stakeholder?",
      "text1": "Validate whether the stakeholder named in the feature precondition is the same one you have in mind in the situation described in the example?<br></br>If the stakeholder is the same and  they all have experienced the situation described in the example, then select the answer “Yes“. When about half or only some of the stakeholders have experienced the situation described in the example, select the answer “Partly“. If none of the users named in the precondition have experienced the situation described in the example, select “No“. If it is known that there are stakeholders who have experienced the situation described in the example, but you cannot identify them more precisely, select “Don’t know“.",
      "subheading2": "Step 4.2. The same context?",
      "text2": "Validate, whether the context intended in the prerequisite is the same as what you mean in the situation described in the comparable example?<br></br>The context of usage “comprises a combination of users, goals, tasks, resources, and the technical, physical, social, cultural, and organisational environments in which a system, product, or service is used” (<i>ISO 9241-11: Ergonomics of Human System Interaction: Usability, Definitions, and Concepts. ISO 2018</i>) but also time and purpose, and whether the usage is by beginners or experienced users. The last one – beginners or experienced users – could be taken into account when defining a stakeholder (in Step 2) and decide whether to split the stakeholder into multiple groups based on their experience. In the EbA method, it is up to the analyst to decide which factors make up the relevant context for the feature preconditions.<br></br>If the context of the example overlaps with the context of the precondition completely, then select the answer “Yes”. If some important aspects of the context are not consistent, then select “Partially”. If the contexts are different, select “No”. If you do not know the answer to the context overlap, select “Don't know”.",
      "subheading3": "Step 4.3. Purposeful action?",
      "text3": "Evaluate whether the stakeholder acted in the comparable example situation as expected and according to the purpose or to what extent they had the expected skill, knowledge, attitude, or resources.<br></br>In the comparable example situation, the same aspect that was focused on in the precondition must be assessed. For example, if the presence of a skill or knowledge is mentioned as a precondition, then evaluate to what extent this skill or knowledge met the expectations in the example situation, i.e., whether the stakeholder knew enough or whether the knowledge was apparent. If you expect the stakeholder to have some technical equipment or devices in use, evaluate the extent to which the stakeholder was using equipment or devices in the situation given as an example. If the precondition focuses on users' motivation, assess the stakeholder's motivation in the example situation.<br></br>For example, if the precondition describes that the stakeholder follows the agreed process in detail, then the core element here is “following the process in detail” (see the description in Step 3). An example situation for comparison describes a situation where the same stakeholder is required to follow a different process at work, but with a similar level of detail. In Step 4.3 we should evaluate to what extent the stakeholder follows the process in detail. If the details are fully followed, the answer is “Yes”. If there is some deviation, the answer is “Partly”. If the details are not followed in the process, the answer is “No”. If at the moment you do not know to what extent the stakeholder follows the process in detail, the answer is “Don't know“.",
      "text3OLD": "Please evaluate whether the stakeholder did act in the comparable example situation as expected and according to the purpose.<br></br>If the presence of a skill or knowledge is mentioned as a precondition, then evaluate to what extent this skill or knowledge met the expectations in the example situation, i.e., whether the stakeholder knew enough or whether the knowledge was apparent. If you expect that the stakeholder has some technical equipment or devices in use, evaluate the extent to which the stakeholder was using equipment or devices in the situation given as an example. If the precondition focuses on users' motivation, assess the stakeholder's motivation in the example situation. In the example situation, the same aspect that was focused on in the precondition must be assessed.<br></br>For example, if the precondition describes that the stakeholder follows the agreed process in detail, then the core element here is “following the process in detail” (see the description in Step 3). An example situation for comparison describes a situation where the same stakeholder is required to follow a different process at work but with a similar level of detail. In step 4.3 we should evaluate to what extent the stakeholder follows the process in detail. If the details are fully followed, the answer is “Yes”. If there is some deviation, the answer is “Partly”. If the details are not followed in the process, the answer is “No”. If at the moment you don’t known to what extent the stakeholder follows the process in detail, the answer is “Don't know”.",
      "subheading4": "Step 4.4. Stakeholder satisfaction?",
      "text4": "Evaluate whether the stakeholder mentioned in this example situation was satisfied with doing the activity expected of them or if they had to have the expected skill, knowledge, attitude or resources. Satisfaction could be interpreted as a positive attitude or acting without complaints. For example, if you focus on the presence of skill or knowledge, you can assess whether the stakeholder was satisfied that they were expected to be able to do or know something at the expected level when performing the activity in the example situation, or if they had any complaints about the expectations. As another example, if it was expected that the stakeholder would have resources or equipment, you can assess whether the stakeholder was satisfied that they had to have a certain resource or equipment. If you analyse the attitude or motivation, it is possible to assess whether the stakeholder was satisfied in the example situation that a certain attitude or motivation was expected of them.<br></br>For example, in Step 4.3, we evaluated the extent to which stakeholders followed the process in detail. Now, we evaluate stakeholder satisfaction following the process in detail. If no complaints have been received regarding the request to follow the process in detail, the answer is “Yes”. If you know there are some complaints, the answer to satisfaction is “Partly”. If a critical number of complaints have been received from the stakeholder, which in sum indicates a high level of dissatisfaction, the answer is “No”. However, if there is no information about satisfaction, select “Don't know”.",
      "example": "In our example, we compare and evaluate feature precondition No. 1 (<i>Customers upload attachments in a file format that the recipients of the files have software programmes to open</i>) with the example presented for comparison (<i>Currently, customers send files with email attachments that the recipients of the files have had to open on Windows computers</i>) as follows:<br></br>4.1.) “Yes”, the stakeholder is the same one who previously sent files by email.<br></br>4.2.) “Yes”, the context is the same, because the same kinds of files were created and sent by the customers.<br></br>4.3.) It was a “partly” purposeful action because not all customers send attachments in a file format that opens on the computers of the recipients of the files, as they use computers with the Windows operating system. For example, some customers have sent files that require the IoS operating system.<br></br>4.4.) The answer to the question about the satisfaction of the clients is “no”, as it has been time consuming for those clients who have had to send the file in the new format."
    },
    "step5": {
      "header": "Step 5. Prioritize examples (if needed)",
      "text": "If you have multiple examples for a precondition and the answers to Steps 4.1–4.4 do not overlap, please prioritise the most relevant example for you. In the EbA-UIM tool, a text field appears for this purpose if the mentioned situation occurs during the analysis. Selecting the most relevant example reduces the workload in Step 7."
    },
    "step6": {
      "header": "Step 6. The EbA method formulates a sentence indicating to what extent the stakeholder's actions correspond to the expectations mentioned in the preconditions",
      "text": "At this step, the EbA method formulates a sentence indicating to what extent the stakeholder's actions correspond to the expectations mentioned in the preconditions. A sentence is formulated from three parts: the combination of answers given in Step 4 (see under the label “Combined answers”) is added to the stakeholders and feature precondition mentioned in Step 2. The first half of this sentence -- the verbal expression of the answers to the four questions -- describes the extent to which the precondition is met. The answers given in Steps 4.1–4.4 provide the option of 256 combinations of answers. The full list of combinations can be found under the label “Combined answers”.<br></br>Using the EbA method tool, the sentence describing the extent to which the precondition exists is automatically combined. If you do not use the EbA tool, find a combination of the 256 sentences in “Combined answers” that match the answer in 4.1–4.4. In this sentence, the Stakeholder and the Feature precondition should be added (see Fig. 6). The stakeholder and precondition are exactly the same as you entered previously in Step 2.",
      "text2": "The combined sentence could be read as an answer to the question that appeared when we previously wrote down the feature's preconditions in the EbA method tool. The question is: Do + Stakeholder + Feature precondition?<br></br>If, while reading the sentence, you notice that the precondition section of that sentence needs to be changed, you can change it in the field where you originally entered the precondition: “Feature precondition“.<br></br>In the EbA method tool, the combined sentence is displayed in two ways: as three separate parts and combined into one sentence. The merged sentence can be hidden if desired.<br></br>Based on the answers given in Step 4, you may not receive information about your stakeholder. However, you may receive information about a different stakeholder. In the EbA method, the information obtained about other stakeholders and different contexts is also valued since we can receive positive or warning examples from it. The “Don't know” information is also essential in the EbA method because in the case it is important for the analyst to know the level of the precondition to exist, then the answer “Don't know” directs to research this precondition in more detail or testing with users.",
      "example": "Let us remind you that our feature precondition number 1 raised the question: Do customers upload attachments in a file format that the recipients of the files have software programmes to open? After performing steps 1–4 with the input described above, EbA gives the following answer: “There is dissatisfaction with this precondition, but to an extent + customers + upload attachments in a file format that the recipients of the files have software programmes to open”."
    },
    "step7": {
      "header": "Step 7. Make a conclusions and create an action plan",
      "text": "After performing steps 1–4 and, if necessary, prioritising examples (Step 5), based on the answers, decide whether the preconditions are met sufficiently for the solution to work successfully. If this is not the case, decide how to improve the situation. Create an action plan (see Fig. 7). It is recommended to analyse all the feature preconditions listed before creating an action plan to prevent probable conflicts between conclusions.",
      "text2": "If in Step 5, you had to choose the most relevant example situation from several examples given for the same precondition, then create a conclusion and action plan only for the outcome you had for the most relevant example situation. Leave the lower-priority examples aside.<br></br>How to interpret in EbA combined sentences that indicate the action of stakeholders? If an comparable example situation has been found for the precondition, whose target group and context (partially) overlap, and the intended use and satisfaction with the solution have received the answer “Yes”, “Partly”, or “No” we could read this sentence as a prediction of user action in the product we are developing. You can decide whether the preconditions for the feature are sufficiently present for the product to function efficiently. If so, it gives confidence that there should not be any significant problems in this regard. If not, what should be changed? What should be done differently? If the analysis leads you to change any features in the product solution, perform the EbA analysis again on the updated aspect.<br></br>If the example situation given as a comparison to the precondition applies to another stakeholder group or other context, we can also get important information from there. For example, if a different stakeholder has no problem meeting the precondition and is satisfied, then it would be helpful for us to know what has created such a good result in that context and if there is anything to learn. Conversely, if there are problems with goal achievement and/or satisfaction, this situation could be analysed as a warning example. However, examples from other stakeholders or contexts do not allow us to draw conclusions about our stakeholders and context. For this, either additional analysis or testing with users must be planned.<br></br>A “Don't know” answer gives us a guideline to investigate further the presence of a precondition or mark it as something that needs to be tested by user testing. Some special attention should be paid to situations where purposeful use has received the answer “Yes”, but satisfaction has the answer “No” It provides information on a situation where a stakeholder acts as intended, but you could consider whether something should be solved differently in your system to prevent dissatisfaction.<br></br>In addition, if you need an overview of what types of activities need to be performed, you can label them by content and color based on what type of action plan is needed. The EbA method suggests dividing the action plan into the following categories:",
      "plan1": "The precondition of the feature is met, that is, “it works”",
      "plan2": "Technology needs to be complemented",
      "plan3": "The solution does not work this way and a different solution has to be found",
      "plan4": "The feature needs a support action",
      "plan5": "The precondition needs to be tested or further analysed",
      "plan6": "Something else",
      "example": "In our example, after analysing all five preconditions, the analyst can decide what to do to improve the aspect of dissatisfaction. When offering a solution, it is essential to ensure that it does not conflict with the action plan of the rest of the preconditions of the feature and is consistent with the overall purpose of the product. Without knowing the results of the analysis of the remaining preconditions of this feature, we can decide, at the moment, that to prevent dissatisfaction, the file formats should be limited and customers should be shown which formats are allowed to upload. The example is illustrated in Figure 8."
    },
    "nb": {
      "header": "By using the EbA method, please keep in mind:",
      "text": "<ol><li>The EbA method helps to get answers to what is asked, according to what is entered as features and what is asked as preconditions, both in terms of content and scope.</li><li>The content of the analysis and the quality of the action plan related to the expanded knowledge of the person making the analysis and the ability to identify related stakeholders, describe stakeholders' activities in the planned product, and the preconditions expected from the stakeholders.</li><li>The validity of the information obtained from the analysis depends on the situation of the example (Step 3) given for comparison to the precondition and its adequate evaluation (Step 4).</li><li>EbA does not remove the need to test with users, but it helps design testing tasks more consciously.</li></ol>",
      "text2": "EbA-UIM tool allows you to download the analysis from the main page in Excel or JSON file format. It is recommended to use the JSON format if you plan to send the analysis to another computer or to another person, so that he can continue his analysis in the EbA-UIM tool on his own computer."
    },
    "figures": {
      "1": "assets/Figures/Figure_1.png",
      "2": "assets/Figures/Figure_2.png",
      "3": "assets/Figures/Figure_3.png",
      "4": "assets/Figures/Figure_4.png",
      "5": "assets/Figures/Figure_5.png",
      "6": "assets/Figures/Figure_6.png",
      "7": "assets/Figures/Figure_7.png",
      "8": "assets/Figures/Figure_8.png"
    },
    "figureText": {
      "1": "Figure 1. The EbA framework",
      "2": "Figure 2. The description of the planned solution is divided into features",
      "3": "Figure 3. For each feature it should be decided who are the stakeholders involved in the feature and what are the preconditions",
      "4": "Figure 4. For each precondition, the closest comparable example situation that the stakeholder has experienced in the past should be found",
      "5": "Figure 5. Validating to what extent the feature precondition and the example situation match, and evaluating the action of the stakeholders in the situation",
      "6": "Figure 6. EbA yields a combined answer as a part of the sentence that describes the precondition situation and combines this with the Stakeholder and Feature precondition",
      "7": "Figure 7. Based on predictions, make an action plan",
      "8": "Figure 8. An example analysed by the EbA framework"
    }
  },  
  "combinations": {
    "header": "Combined answers",
    "section1Heading": "1. Combinations",
    "section1Text": "In the table below, you can find all the combinations of four questions and four answers. There are 256 combinations in total. One more description has been added to the 256 combinations in case a previously experienced example has not been found for comparison.<br></br>An interpretation is provided for each combination that forms a part of the sentence to which the stakeholder's name is added to the sentence along with the feature precondition (see under label “EbA Method”) . Combined into one sentence, the sentence provides an indication to what extent the stakeholders' actions meet the expectations described in the precondition.<br></br>The combinations are interpreted by Anu Piirisild.<br></br>Variants of combinations and their wording are as follows:",
    "section2Heading": "2. Interpretation of combinations",
    "section2SubHeading": "2.1. How to read the answers of the combinations in the EbA method tool",
    "section2Text": "The results can be read in different ways, according to which one feels more applicable:<br></br><ol><li>Look at the triple column “To what extent the preconditions are met”, where each part of the sentence is listed in a separate column: interpretation of the combination of answers + stakeholder + feature precondition. Such a sentence display is preferred for those who want to read the result as a whole sentence but, at the same time, keep each part of the sentence in a separate column.</li><li>Look at the 3-part sentence joined together. In the EbA method tool, the sentence is located after the triple column “To what extent the preconditions are met”. This sentence display is intended for those who want to read the result as a complete sentence without separating the parts of the sentence. We recommend using this column when the results of the analysis are included in the project documentation and there is a desire to indicate the input for the decisions of the action plan, that is, what the result of the EbA analysis was. In the EbA tool, this sentence column can be hidden.</li><li>Look at the yes-partly-no-don't know answers to the four questions independently, without the interpretation, and the included stakeholder group with the feature precondition, and give your own interpretation of the situation.</li></ol>",
    "section2SubHeading2": "2.2. The principles of creating the formulation for combinations",
    "section2Text2": "When interpreting the combinations, it has been ensured that i) the sentence contains the most essential aspects of the situation and the result gives meaningful information; ii) syntax of the sentence would allow linking to it the stakeholder and feature precondition without changing the wording; iii) the sentence can be used for different types of preconditions; iiii) repeated elements can be used in the sentence.<br></br>The answers are intended to cover different types of assumptions universally, for example, knowledge, awareness, attitudes, skills, emotions, and availability of tools or activities. Therefore, the answers should be read with some abstraction.<br></br>The principles of interpretation and repeated elements used in the phrases are described in the following:",
    "selection1Heading": "2.2.1. The same stakeholder? – interpreting the answers in a sentence",
    "selection1Yes": "In the case of the answer “Yes”, the stakeholder is not mentioned in the sentence because the answer describing the situation gives itself the concept that the information applies to the entire stakeholder group.",
    "selection1Partly": "The answer “Partly” means that the example of the previous experience situation provided for comparison in the EbA method applies to some of the stakeholders' representatives. Therefore, we can draw conclusions about only some stakeholder representatives only. In this case, the word \"some\" is used in the sentence. However, an exception is made if the answer to the purposeful action is “No“ or “Don't know“. In such a case, the answer is generalised to the entire stakeholder group of the situation because even if the smaller number of the whole stakeholder group did not act according to the purpose (answer “No”), or the result of the action was not known (answer “Don't know”), we cannot assume that the action in the created product will be purposeful.",
    "selection1No": "If the answer is “No”, the sentence indicates that “there is a different stakeholder” about whom we have information, which should direct the reader to look at the actions of another stakeholder group to learn from there. However, the sentence reminds us that we don't know about the actual stakeholder, whether the prerequisite is met or not.",
    "selection1DontKnow": "If the answer is “Don't know”, the sentence indicates that “there is a stakeholder” about whom we have information, although this stakeholder cannot be defined at the moment. The answer should direct the reader to define the stakeholder more precisely, if necessary, to learn from the experience there. However, the sentence reminds us that we don't know about the actual stakeholder, whether the precondition is met or not.",
    "selection2Heading": "2.2.2. The same context? – interpreting the answers in a sentence",
    "selection2Yes": "In the case of the answer “Yes”, the context exactness is not mentioned in the sentence because the answer gives itself the concept that there are no differences in context.",
    "selection2Partly": "The answer “Partly” indicates that the information applies to a “slightly different context”.",
    "selection2No": "If the answer is “No”, the sentence uses the expression “in another context”, which should direct the reader to look at these other contexts to take a good or a warning example from there.",
    "selection2DontKnow": "If the answer is “Don't know”, the sentence uses the expression “in an unknown context”, which should direct the reader to learn more about this unknown context to take a good or a warning example from there.",
    "selection3Heading": "2.2.3. Purposeful action? – interpreting the answers in a sentence",
    "selection3Yes": " In the case of the answer “Yes”, the outcome of the action is not mentioned in the sentence if the stakeholder is the same (answer “Yes”), or partly the same (answer “Partly”). It is expressed this way because the answer itself gives the concept that the action outcome is purposeful. If the answer to the question “The same stakeholder?” is “No”, or “Don't know”, the action outcome is shown in the sentence as purposeful.",
    "selection3Partly": "The answer “Partly” is expressed in the sentence with the wording “to an extent”, which means that the scope, quality, or activity of the action meets the expectations only partially.",
    "selection3No": "If the answer is “No”, the sentence uses the expression “the action outcome is incorrect”. If the answer is “no”, the sentence also contains a reminder that based on the current information, we cannot assume that the actions will be purposeful while using the new product. This, in turn, means that the purposefulness of the stakeholder's actions must either be analysed further or prepared for testing.",
    "selection3DontKnow": "The answer “Don't know” is expressed in the sentence with the wording “the action outcome is unknown”. If the outcome of the action is not known, the sentence also contains a reminder that, based on the current information, we cannot assume that the actions will be purposeful while using the new product. This, in turn, means that the purposefulness of the stakeholder's actions must either be analysed further or prepared for testing.",
    "selection4Heading": "2.2.4. Stakeholder satisfaction? – interpreting the answers in a sentence",
    "selection4Yes": " In the case of the answer “Yes”, satisfaction is not mentioned in the sentence because the answer describing the situation gives the concept that there is no problem with satisfaction.",
    "selection4Partly": "The answer “Partly” is expressed in the sentence with the wording “there is somewhat dissatisfaction with this precondition”, which means that there are some problems with satisfaction.",
    "selection4No": "If the answer is “No”, the sentence uses the expression “there is dissatisfaction with this precondition”. This information should guide the reader to find a different solution with which the probability of satisfaction would be higher.",
    "selection4DontKnow": "The answer “Don't know” is expressed in the sentence with the wording “satisfaction with this precondition is unknown”. This information should guide the reader to determine satisfaction through further analysis or testing with users."
  },
  "example": {
    "header": "Example",
    "area": "A larger-scale fictional example, where the EbA method has been applied to analyze a solution, can be found on the homepage under the project name “Example ENG”. The input for the fictional example is described on this page.",
    "section1Heading": "Input for the analysis of the project “Example ENG”",
    "section1Text": "Customers of the hair salon LAHE have previously had the option to book appointments either through the booking system on the website or by calling the salon by phone.  The salon has no administrator because it is a small salon, and they try to keep the costs low. Salon hairdressers feel that answering the phone while serving a customer is impolite. Hairdressers favor when customers book their appointments online.<br></br>Hairdressers want to introduce an answering machine that activates if no one answers the phone within three seconds. The message of the answering machine directs clients to book online. The same suggestion applies to the need to change the booking.<br></br>Almost a third of the bookings at this hair salon are made by phone. Hairdressers at the salon say the reservations by phone are mainly made by older people, who are estimated to be over 65 years old. Younger customers dominate among those who book online, but older customers are presented as well.  It is unknown whether the elderly customers made the online booking independently or if they used somebody's help.<br></br>Hairdressers have previously received two types of feedback from their elderly customers about booking online: i) customers do not feel confident when booking on the homepage; ii) customers could not find where to book on the website.<br></br>It is decided that, in addition to the answering machine, the functionality of making a reservation on the website must also be improved so that it will be easy for older adults to book there. The changes by introducing an answering machine and improving the functionality on the homepage must not scare any customers away.<br></br>The proposed solution – containing both previous and changed elements – is the following:<ol><li>When clients call the hair salon within business hours, after three seconds of inviting tones, the answering machine turns on, and a voicemail message informs that all hairdressers are currently busy and suggests to open the hair salon's homepage lahe.ee and make a booking or change the booking from there, or call later.</li><li>The BOOKING ONLINE button is moved to the very first place in the menu bar. The background color of the BOOKING ONLINE button is changed to stand out from the rest of the menu bars. Since the menu buttons and text will be made more prominent, more space is needed for the menu. Therefore, the NEWS menu will be left out (there are very few readers on the news page. Therefore, there is no point in keeping it anyway). All website content is published in one language (national language).</li><li>After clicking on the BOOK ONLINE button, the web page displays an encouraging text, which confirms that the customer will be guided when booking online; just need to fill in the fields and follow the instructions to the end until the message “Your booking is confirmed”.</li><li>Below the encouraging text, the web page displays a list of primary services: women's hairdresser, men's hairdresser, children's hairdresser, and change reservation. By choosing either a women's, men's, or children's hairdresser, the system opens the list of possible services, while the standard options for elderly customers are raised to the top of the list.</li><li>By changing the reservation, the web page displays the following text and additional fields: first name, last name, phone number, or email, and a free text field where customers can write the reservation time and choose a new time.  At the end, there is a “Send” button. After clicking the “Send” button, the system displays the following notification: the information has been sent, and the salon will take contact.</li><li>After the customer has chosen a service (women's, men's, or children's hairdresser), the system asks for the hair length (short, shoulder-length, long).</li><li>After the customer has selected the hair length, the system displays the duration and price of the service, as well as the fields “Choose a hairdresser”, and “Choose a date”.<br></br>7.1. After the client has selected the hairdresser's name from the drop-down menu, the system displays a side-by-side calendar view, where the free dates of this hairdresser are displayed with a distinctive background color, and the rest of the dates are inactive. If the customer selects the name of another hairdresser, the system will make the free dates of the chosen hairdresser active.<br></br>7.2.  When the customer selects by date, the system displays the available dates to the customer with a distinctive background tone. When the customer clicks on the date, the system displays the start time of the service. If the customer changes the date, the system will show the available hours for the selected date. Once the customer has chosen the start time of the service, the system displays the hairdresser's name and the button “Continue booking”.<br></br></li><li>After the customer has clicked “Continue booking”, the system will show the customer a summary of the previously made booking and ask to fill in the fields: first name, last name, e-mail, phone, and “Confirm booking”. The customer clicks “Confirm booking”, but if any fields are not filled in, the system marks this place in red and displays the text: “Please fill out all required fields.”</li><li>After the customer has confirmed the reservation, the system displays the following notification to the customer: “Your appointment has been successfully booked.  We will send you a reminder by e-mail a day before. Please let us know if you need to reschedule by clicking “Change reservation”.”</li><li>One day before the service, the system sends a reminder to the e-mail specified by the customer with information about the service.</li></ol><i>The company LAHE and its business needs for the EbA analysis used as an example (see project “Example ENG” on homepage of the EbA-UIM tool) is fictional. The validation data is planned to be collected from shared knowledge and discussions with hair salon employees.</li>"
  },  
  "about": {
    "header": "About",
    "area": "Information about the EbA method and the EbA-UIM tool<br></br>Copyright<br></br>Contacts",
    "section1Heading": "EbA Method",
    "section1Text": "The motivation for creating the Experience-based Analysis (EbA) method is to make the development of digital products and services more cost-effective, since EbA method provides an early indication in digital product or e-service development of whether the solution will function efficiently in terms of stakeholders' behavior and habits, and identify potential risks that may arise. The EbA method was invented by Anu Piirisild, who first described the method in 2021 in her master's thesis. However, she continues to improve the method in her doctoral studies at the University of Tartu. The method is currently in the PoC-phase (Proof-of-Concept). We would appreciate it if you could share your experience with the EbA method and the tool with us. Please send your feedback to the e-mail address <a href='mailto:anu.piirisild@ut.ee'>anu.piirisild@ut.ee</a>.",
    "section2Heading": "EBA-UIM tool for the EbA method",
    "section2Text": "The <b>EBA-UIM</b> tool was created to make using the Experience-based Analysis (EbA) method easier. The tool helps structure the information and displays the descriptions predicting the usability of the product/e-service under development automatically.<br></br>In the tool, you can create projects and make analysis by EbA method. In the next versions of the tool, the option of making a copy of projects is planned to be added. At the moment, you can also download projects in Excel format from the front page, but the design solution for the downloaded file format will be updated. In the downloaded Excel file, you can customize the analyzed information according to your needs; for example, hide unnecessary columns for the report, emphasize the texts, and use background colors for field marking.<br></br>The tool contains a fictional example project, a description of the EbA method and a guide to use the method. The tool is available in two languages: Estonian and English. The tool is planned to be updated, so we recommend you visit the updated version occasionally. <br></br><b>EBA-UIM tool</b> is an offline desktop application that stores the data on the user’s own machine. The application will be hosted in the High Performance Computing Center of the University of Tartu. <br></br><br></br><b>Copyright (c) 2024 University of Tartu</b><br></br>Any person who acquires a copy of this Software and related documentation files (“Software”) is hereby granted a free license to use and copy the Software, and the persons to whom the Software is supplied are permitted to do so, subject to the following conditions:<ul><li>This copyright notice and this permission notice shall be included in all copies of the Software.</li><li>Only the use of the Software is allowed, and all other activities are prohibited (e.g. modifying the Software etc.).</li><li>Software refers to both the software itself and the methods used in the software.</li></ul>THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND. IN NO EVENT SHALL LICENSOR BE LIABLE FOR DAMAGES, INCLUDING ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS OR SAVINGS, BUSINESS INTERRUPTION OR OTHER COMMERCIAL DAMAGE OR LOSS, ARISING FROM THE USE OF THE SOFTWARE.",
    "section3Heading": "EBA-UIM tool team",
    "section3Text": "<b>EBA-UIM</b> application is an improved version of the preliminary version of the EbA method tool. The EBA-UIM application has been developed by Tartu University informatics students Karl Olaf Kuldmaa and Iris Kreinin as part of their bachelor thesis. Karl Olaf Kuldmaa created the back-end, front-end and database of the application. Iris Kreinin created front-end and its user interface. Anu Piirisild created the EbA method guide, texts explaining the method, and an example project.",
    "contact": "Contacts",
    "address": "Anu Piirisild<br></br><a href='mailto:anu.piirisild@ut.ee'>anu.piirisild@ut.ee</a><br></br><br></br>University of Tartu<br></br>Institute of Computer Science<br></br>Narva mnt 18<br></br>51009 Tartu, Estonia",
    "overview": "The next three topics give an overview of the page content"
  },
  "backToTop": {
    "buttonLabel": "TOP",
    "ariaLabel": "Button for scrolling back to the top. Press Enter, Space, or use Ctrl + Up Arrow to activate."
  },
  "noExampleModal": {
    "title": "Confirm No Situation",
    "message": "Are you sure you want to mark this as 'No situation'? This will reset all selections for this example.",
    "confirm": "Confirm",
    "cancel": "Cancel"
  },
  "noExampleNotification": {
    "message": "The example has been marked as 'No situation'"
  },
  "hidePanels": {
    "hide": "Hide",
    "unhide": "Show panels",
    "ariaLabel": "Button to toggle visibility of project tabs. Press Enter, Space, or use Ctrl + Up Arrow to activate."
  },
  "hideColumn": {
    "hide": "Hide column (Ctrl+H)",
    "show": "Show column (Ctrl+H)"
  },
  "colorPicker": {
    "change": "Categorise action plan",
    "close": "Hide"
  },
  "colorPickerExplanation": {
    "green": "The precondition of the feature is met, that is, \"it works\"",
    "orange": "Technology needs to be complemented",
    "red": "The solution does not work this way and a different solution has to be found",
    "yellow": "The feature needs a support action",
    "blue": "The precondition needs to be tested or further analysed",
    "grey": "Something else",
    "default": "No category"
  },
  "prioritizationNotice": {
    "message": "Multiple situations have been added under this precondition. They can be prioritized by using the checkbox ✅.",
    "title": "Prioritizing opportunity"
  },
  "conclusion": {
    "changedNotice": "The previous combination of answers has been changed. If necessary, update the action plan"
  },
  "skipButton": {
    "skipToTable": "Skip to main table content"
  },
  "confirmModal": {
    "deleteRowTitle": "Delete row",
    "deleteRowMessage": "Are you sure you want to delete this row?",
    "deleteExampleTitle": "Delete situation",
    "deleteExampleMessage": "Are you sure you want to delete this situation?",
    "deleteFeatureTitle": "Delete feature",
    "deleteFeatureMessage": "Are you sure you want to delete this feature?",
    "deletePreconditionTitle": "Delete precondition",
    "deletePreconditionMessage": "Are you sure you want to delete this precondition?"
  },
  "paginationButton": {
    "previous": "Previous",
    "next": "Next"
  },
  "pagination": {
    "of": "Total",
    "page": "Page"
  },
  "loading": {
    "spinner": "Loading content"
  },
  "dropdownMenu": {
    "name": "Open dropdown menu"
  },
  "questionnaires": "Questionnaires",
  "et": "EST",
  "en": "ENG"
}
