{
  "button": {
    "delete": "Delete",
    "edit": "Edit",
    "add": "Add",
    "cancel": "Cancel",
    "import": "Upload (JSON)"
  },
  "menu": {
    "edit": "Edit",
    "delete":"Delete",
    "copy": "Make a copy",
    "download": "Download",
    "downloadExcel": "Download as Excel",
    "downloadJson": "Download as JSON",
    "deleteFeature": "Delete this feature",
    "addStakeholder": "Add a stakeholder",
    "addPrecondition": "Add a preconditon",
    "deletePrecondition": "Delete this preconditon",
    "addExample": "Add another situation",
    "deleteExample": "Delete this situation",
    "noExample": "No situation",
    "noStakeholder": "No stakeholders yet"
  },
  "toolbar": {
    "name": "EbA-UIM",
    "projects": "Projects",
    "method": "EbA Method Guide",
    "about": "About",
    "skipToMain": "Skip to main content"
  },
  "languages": {
    "est": "EST",
    "eng": "ENG"
  },
  "addProject": {
    "title": "New project",
    "input": "Project name",
    "placeholder": "Project name"
  },
  "projectsTable": {
    "title": "Projects",
    "seeMore": "Enter project ->",
    "sortByLastModified": "Last modified"
  },
  "deleteProjectModal": {
    "title": "Delete project: {{name}}",
    "body": "Are you sure you want to delete the project?"
  },
  "deleteFeatureGroupModal": {
    "title": "Delete feature group",
    "body": "Are you sure you want to delete the feature group?"
  },
  "deleteStakeholderModal": {
    "title": "Delete stakeholder",
    "body": "Are you sure you want to delete the stakeholder?"
  },
  "editProjectModal": {
    "title": "Edit project name",
    "input": "Project name"
  },
  "editFeatureGroupModal": {
    "title": "Edit feature group name",
    "input": "Feature group name"
  },
  "editStakeholderModal": {
    "title": "Edit stakeholder name",
    "input": "Stakeholder name"
  },
  "addGroup": {
    "title": "Add a new table tab",
    "list": "Existing table tabs",
    "input": "Table tab name",
    "placeholder": "Enter feature ID or abbreviation",
    "defaultTabName": "Tab 1"
  },
  "addStakeholder": {
    "title": "Add a new stakeholder",
    "list": "Existing stakeholders",
    "input": "Stakeholder name",
    "placeholder": "Enter the name in plural"
  },
  "table": {
    "newRow": "Add new row",
    "deleteRow": "Row deletion",
    "delete": "Delete",
    "edit": "Edit",
    "save": "Save",
    "cancelEdit": "Cancel editing",
    "deleteRowARIA": "Delete row",
    "saved": "Changes are saved automatically"
  },
  "select": {
    "chooseOption": "Select",
    "yes": "Yes",
    "no": "No",
    "dontKnow": "Don't know",
    "partly": "Partly"
  },
  "methodCombinations": {
    "CHOOSE_OPTION": "Select",
    "YES": "Yes",
    "NO": "No",
    "DONT_KNOW": "Don't know",
    "PARTLY": "Partly"
  },
  "plan": {
    "": ""
  },
  "methodTabs":{
    "method": {
      "tab": "EbA Method Guide",
      "subtab": "Method",
      "subtab1": "Step 1",
      "subtab2": "Step 2",
      "subtab3": "Step 3",
      "subtab4": "Step 4",
      "subtab5": "Step 5",
      "subtab6": "Step 6",
      "subtab7": "Step 7",
      "subtab8": "NB"
    },
    "combinations": {
      "tab": "Combined answers",
      "subtab": "Combinations",
      "subtab1": "Interpretation"
    },
    "example": {
      "tab": "Example"
    }
  },
  "method": {
    "general": {
      "example": "Example"
    },
    "intro": {
      "title": "EbA Method Guide",
      "header": "Experience-based Analysis (EbA) Method – a method for inspecting the usability of a digital product or e-service under development",
      "area": "What is the EbA method?<br></br>How to apply the EbA method?<br></br>What do you need to know when using the EbA method?",
      "text": "The Experience-based Analysis (EbA) method has been created to provide an early indication in the development of digital products or e-services (“product“ hereafter) as to whether the planned solution will function effectively and what potential risks may arise – specifically from the perspective of user behaviour and habits. This means analysing usability in a broader sense. In the EbA method, conclusions about usability are drawn from what the product solution designer assumes about end users and related parties (hereafter: stakeholders), and from the stakeholders’ past experiences – particularly, how they have previously fulfilled these preconditions and how satisfied they were in doing so.  Based on the evaluation of prior experience, the EbA method offers insight into how well stakeholders possess the knowledge, skills, habits, or resources that the product solution designer deems necessary for the product’s success. The method is grounded in the assumption that people tend to act according to established patterns of experience.<br></br>The EbA method can be used for usability inspection as soon as a new solution has been described. In the context of EbA, solution descriptions may include statements about what users can or must do, user stories, use cases, scenarios, process descriptions, general overviews from business analysis or strategic documents, journey map data, or other similar inputs that describe the planned solution and the intended types of users. Using the EbA method, it is possible to assess whether the product, if implemented as planned, is likely to function effectively, whether the solution should be modified, or whether certain aspects require further investigation. Conducting this analysis early on offers an overview of the situation before prototyping, user testing, and development begin. The information gained from the analysis helps refine the input for the subsequent stages of development. It also supports better preparation for user testing by identifying preconditions that need verification – particularly those where the analysis team lacks sufficient insight. At the same time, aspects that have already been validated through analysis may be excluded from testing.<br></br>EbA is intended to be used by the people who elicit and analyse the requirements. In addition to requirements engineers, it can also be effectively used by product owners, business analysts, and other relevant roles. The person conducting the EbA analysis should have a good understanding of the product domain, its context, and its users.<br></br>Figure 1 shows the framework of the EbA method. The figure shows the components required for the analysis and the process steps that the method user must take to obtain the result.",
      "text2": "In the EbA method, the full description of the planned solution should first be divided into distinct features. For each feature, identify the stakeholders involved and determine the skills, knowledge, attitudes, activities, and means are expected from the stakeholders as preconditions within this specific feature to make the feature function efficiently. For each precondition, an example must be identified in which the stakeholder has previously experienced the situation described in the precondition. The EbA method then generates a sentence that indicates the extent to which the stakeholder’s actions meet the expectations set by the precondition. After that, the EbA method formulates a sentence indicating to what extent the stakeholder's actions correspond to the expectations mentioned in the preconditions. These answers help the person conducting the analysis determine whether the preconditions are sufficiently met for the solution to function successfully and support the planning of further activities. The EbA method is explained in more detail in the following steps.<br></br>When using the EbA method and the EbA-UIM tool for the first time, we recommend exploring the analysis process and method’s capabilities with a sample project. You can download the sample file “Example_ENG.json“ from the same repository link where you downloaded the EbA-UIM application. The Example_ENG.json file can be uploaded directly from the application’s first page, via the “New project“ section. The context of the sample project is described in the tool under “EbA Method Guide“ > “Example“."
    },
    "step1": {
      "header": "Step 1. Divide the description of the planned solution into features",
      "text": "Organise the description of the product/e-service (“product“ hereafter) into smaller features, placing each feature in a separate row (see Fig. 2). In the context of EbA, solution descriptions may include statements about what users can or must do, user stories, use cases, scenarios, process descriptions, general overviews from business analysis or strategic documents, journey map data, or other similar inputs that describe the planned solution and the intended types of users. Divide the entire description into smaller, meaningful and self-contained parts, ensuring that each feature field focuses on a single activity, use case, or unique product attribute.<br></br>In addition to describing the interactions and the product itself, include aspects that represent the product more broadly. This may involve outlining the wider context of the product and its dependencies on other services and processes – both those influenced by the product under development and those that influence it. While these may not be typical functional features, such goals can also be analysed using the EbA method. For example, if the new solution is created with the goal of reducing the need for labour or enabling a process to be completed quickly (e.g., within 30 minutes), these goals can be added to the feature field for analysis. Similarly, if one of the objectives of the product or service is to improve the efficiency of information exchange between parties, it is also useful to include this in the list of features.",
      "example": "Let us assume that the platform of an e-service needs to be complemented so that the customers of the e-service could upload files onto the platform instead of sending them separately by e-mail. The product owner of the e-service expresses his opinion as follows: „The platform does not need to limit the format of the files customers upload because, anyway, customers use common software packages. However, the file to be uploaded should be limited to one file, and the file size can be up to 10 MB.“ As was stated above, in EbA this kind of requirement is viewed as a feature, which in this case can be formulated as follows. The customers of the e-service can upload one file with no format specified but a size limit of 10 MB.",
      "text2": "The EbA tool allows you to group features and rename the category label by topic using the 'Add a new table tab' function. You can also assign an identification number to each feature in the ID field."
    },
    "step2": {
      "header": "Step 2. Decide which stakeholders are involved in the feature and what preconditions are expected from stakeholders within this specific featureDecide which stakeholders are involved in each feature and what skills, knowledge, attitudes, activities, and means are expected from stakeholders within this specific feature to make the feature efficient",
      "text": "Review each feature and identify which end users and related parties are involved in or significantly affected by that specific feature. In the EbA method, these are referred to as stakeholders. When identifying stakeholders, think of the developed solution as the final product in use. This means that roles such as the developer, product owner, or requirements analyst are generally not considered stakeholders. However, a product owner or analyst may be considered a stakeholder if a specific feature includes something that they are expected to take into account or have prepared in advance during the development process. For instance, if a solution generates a user profile based on parameters entered by the end user, the product owner might be a stakeholder – because they are expected to have previously verified that the resulting profile is accurate. Similarly, a developer could be considered a stakeholder if they have an active role in the  product in use – for example, if development continues in parallel with the product's use. In the EbA method, stakeholders should be formulated in the plural form.<br></br>To identify the preconditions, analyse each feature to determine which key skills, knowledge, attitudes, activities, resources, and means you expect from the stakeholders for the feature to function efficiently (see Fig. 3). For example, what must the members of the stakeholder group do, know, or be capable of doing as a precondition for the planned solution of the product to create the intended outcome or value?",
      "text2": "When listing features, include any preconditions that are not directly related to the product under development but either influence it or are significantly influenced by the feature being analysed. For example, if a feature states that “consultations are also provided online with one day’s notice,” then in addition to other requirements, a relevant precondition could be the assumption placed on the employer – that the work schedule for consultants has been planned with the necessary flexibility.<br></br>When identifying and describing preconditions, also take into account the aspects that you, as the product creator, have considered important. For example, these may include emotional goals (e.g., how the stakeholder should feel when using the product), cybersecurity goals (e.g., requirements they must know or meet), or general goals of the product (e.g., reducing bureaucracy or accelerating a process).<br></br>In the EbA method, formulate the feature’s preconditions in a constructive and supportive manner.",
      "example": "In our running example, we had the feature “The customers of the e-service can upload one file with no format specified but a size limit of 10 MB“. The preconditions for this feature in our running example could be as follows:<ol><li><i>customers</i> upload attachments in a file format that the recipients of the files have software programmes to open;</li><li><i>recipients of the files</i> do not need to process the information in the file;</li><li><i>customers</i> know how to compress files without losing the quality of images;</li><li><i>customers</i> know how to compress all the information into one file;</li><li><i>customers</i> do not mind compressing all the information into one file.</li></ol>",
      "text3": "Next, we will evaluate how well the identified preconditions are met. The EbA tool will prompt you with questions structured as: <i>Do + Stakeholder + Feature precondition</i>.",
      "example2": "For example, in the EbA-UIM tool, precondition No. 1 is formulated as the following question: “Do + <i>customers</i> + upload attachments in a file format that the recipients of the files have software programmes to open?”"
  },
    "step3": {
      "header": "Step 3. For each precondition, find an example of a situation that the stakeholder has experienced in the past and correlates with the situation described in the precondition",
      "text": "Any activity, skill, attitude, availability of resources, use of devices, etc., mentioned in the precondition is typically manifested through stakeholder behaviour in real situations. For each precondition, identify a past situation in which the stakeholder demonstrated behaviour similar to what is described in the precondition (see Fig. 4). The example does not necessarily need to come from the context of the same product that you are currently developing. When developing new solutions, we may not find examples that match the exact product or feature, but we may find example situations similar to the preconditions, which represent a smaller part of the feature.",
      "text2": "To find a suitable example for comparison, first consider what your precondition is aimed at and try to identify an example from a similar situation. For instance, if the feature’s precondition requires that the stakeholder must follow an agreed process with precise attention to detail, then look for a situation where the same stakeholder has previously had to follow the same process with that level of precision. Such a situation may have occurred before, even if the process was carried out using a different technology. Ideally, you should identify an example in which the context of the past experience aligns with the context intended in the precondition – for example, where the example situation involved the same type of technology as referred to in the precondition.<br></br>If you cannot find an example that applies to the entire stakeholder group, try to identify one that has been experienced by at least some stakeholder representatives – for instance, where only a few have had to follow the process in detail. If that is not possible, you may also use an example involving a different stakeholder who has been in a similar situation where completing the process in detail was required. The experience of another stakeholder can also provide valuable insights. The same principle applies to context: if you cannot find an example that fully matches the context of the precondition, use one that is similar – for example, where the process differs slightly, where the level of detail was not the same, or where a paper-based process is now being digitised. If finding a similar context is difficult, consider using an example from a different context – such as a different process the stakeholder has experienced in the past, or a non-workplace example if the feature and precondition describe a workplace situation. Different contexts can also yield useful information (see Step 6). You may describe multiple examples for one precondition. If no relevant example can be found, select “No example found“.",
      "example": "In the running example, precondition No. 1 (<i>Customers upload attachments in a file format that the recipients of the files have software programmes to open</i>) is concerned with using software file formats, so that the example situation could be: “Currently, customers send files with email attachments that the recipients of the files have had to open on Windows computers.”"
    },
    "step4": {
      "header": "Step 4. Validate the example with respect to the precondition and evaluate the stakeholder’s actions in the context of the example",
      "text": "In Steps 4.1 and 4.2, validate how well the feature precondition and the example situation align in terms of the stakeholder and the context. In Steps 4.3 and 4.4, evaluate whether the stakeholder’s actions in the comparable situation were purposeful and how satisfied the stakeholder was with the experience. (See Fig. 5)",
      "text0": "To answer the questions in this step, you can use, for example, your own or others' knowledge accumulated over time through work experience or from public sources, previously gathered information available to the product developers, or data found in various studies, statistics, and scientific articles. Information can also be found via internet searches or by asking artificial intelligence – in such cases, it is important to approach the information critically.",
      "subheading1": "Step 4.1. The same stakeholder?",
      "text1": "Validate whether the stakeholders mentioned in the precondition and in the example overlap?<br></br>If all members of the stakeholder group considered in the example situation have also experienced the situation described in the precondition, select the answer “Yes“. If only half or some of the users in the stakeholder group have experienced the situation described in the example, select “Partly“. If the stakeholder group referred to in the example does not match the stakeholder group in the precondition, select “No“. If you believe there is a stakeholder group that may have experienced the example situation but you cannot identify them more specifically, select “Don't know“.",
      "subheading2": "Step 4.2. The same context?",
      "text2": "Validate, whether the context intended in the prerequisite is the same as what you mean in the situation described in the comparable example?<br></br>The context of use “comprises a combination of users, goals, tasks, resources, and the technical, physical, social, cultural, and organisational environments in which a system, product, or service is used“ (<i>ISO 9241-11: Ergonomics of Human System Interaction: Usability, Definitions, and Concepts. ISO 2018</i>) The context of use may also encompass factors such as time, purpose, and the experience level of the users (e.g., beginners or experienced users). This last aspect – whether the users are beginners or experienced – could instead be considered when defining the stakeholder group (in Step 2), and you may decide to split the stakeholder group into two based on their level of experience. In the EbA method, it is up to the analyst to decide which aspects of the context are most relevant and should be considered when evaluating alignment with the precondition.<br></br>If the context of the example situation fully overlaps with the context of the precondition, select “Yes“. If some important aspects of the context differ, select “Partly“. If the contexts are clearly different, select “No“. If you are unsure about the degree of overlap, select “Don't know“.",
      "subheading3": "Step 4.3. Purposeful action?",
      "text3": "Evaluate whether the stakeholder in your comparison example acted as expected, or how well they had the necessary skills, knowledge, attitudes, or resources.<br></br>In the example used for comparison, assess the same aspect that was considered in the precondition. For instance, if the precondition referred to the presence of a specific skill or knowledge, evaluate to what extent this skill or knowledge met expectations in the example situation – i.e., whether the stakeholder had sufficient knowledge or whether it was demonstrably present. If you expected the availability of a certain tool, device, or other resource, assess whether the stakeholder had access to and used it in the given situation. If the precondition focused on motivation, evaluate how motivated the stakeholder appeared to be in the example context.<br></br>For example, continuing with the explanation given in Step 3, where the precondition was that the stakeholder follows the agreed process in detail, the focus of this precondition is on “following the process in detail“. Let us assume that the example situation provided for comparison describes a case where the same stakeholder group is required to follow a different process at work, but with a similar level of detail. In Step 4.3, we assess to what extent the stakeholder group in the example situation follows the process with attention to detail. If the details are fully followed, select “Yes“. If there is some deviation, select “Partly“. If the details are not followed in the process, select “No“. If you are currently unsure to what extent the stakeholder follows the process in detail, select “Don't know“.",
      "subheading4": "Step 4.4. Stakeholder satisfaction?",
      "text4": "Evaluate whether the stakeholder in your comparison example was satisfied while performing the activity. Consider also how satisfied they were with having to know something, possess certain skills, or use specific tools or resources in that situation.<br></br>Satisfaction could be interpreted as a positive attitude or performing the activity without complaints. For example, if you assessed the presence of a skill or knowledge, you can evaluate whether the stakeholder was satisfied with having to demonstrate that level of competence in the example situation – or whether there were complaints, such as: „Why do I need to know or do this?”. If the precondition referred to the availability of certain resources or tools, evaluate whether the stakeholder showed any dissatisfaction with the fact that they were expected to have access to and use these resources or tools in the example situation. If you analysed an attitude or motivation required to carry out an activity, you can assess whether the stakeholder was satisfied with the fact that they were expected to have that attitude or motivation in the example situation.<br></br>For example, in Step 4.3, we evaluated the extent to which stakeholders followed the process in detail. Now in Step 4.4 we assess the stakeholder satisfaction with having to follow the process in such detail. If no complaints have been received regarding the requirement to follow the process in detail, select “Yes“. If you are aware of some complaints, select “Partly“. If a significant number of complaints have been received from stakeholders - indicating notable dissatisfaction – select “No“. If there is no available information about their satisfaction, choose “Don't know“.",
      "example": "In our example, we compare and evaluate feature precondition No. 1 (<i>Customers upload attachments in a file format that the recipients of the files have software programmes to open</i>) with the example presented for comparison (<i>Currently, customers send files with email attachments that the recipients of the files have had to open on Windows computers</i>) as follows:<br></br>4.1.) “Yes“, the stakeholder is the same one who previously sent files by email.<br></br>4.2.) “Yes”, the context is the same, because the same kinds of files were created and sent by the customers.<br></br>4.3.) It was a “partly” purposeful action because not all customers send attachments in a file format that opens on the computers of the recipients of the files, as they use computers with the Windows operating system. For example, some customers have sent files that require the IoS operating system.<br></br>4.4.) The answer to the question about the satisfaction of the clients is “no”, as it has been time consuming for those clients who have had to send the file in the new format."
    },
    "step5": {
      "header": "Step 5. Prioritise examples (if needed)",
      "text": "If you have multiple examples for a precondition and the answers to Steps 4.1–4.4 differ, prioritise the example that is most relevant to your analysis. In the EbA-UIM tool, a text field will appear for this purpose if such a situation arises. Selecting the most relevant example helps reduce the workload in Step 7."
    },
    "step6": {
      "header": "Step 6. The EbA method generates a sentence that indicates how well the stakeholder's actions align with the expectations set out in the preconditions",
      "text": "In this step, the EbA method formulates a sentence that indicates to what extent the stakeholder's behaviour and actions align with the expectations outlined in the feature preconditions. The sentence consists of three parts. The first part is based on the combination of answers provided in Step 4, with a verbal expression describing to what extent the precondition is met or what is known about it (see the label “Combined answers“). This part is then combined with the stakeholder group defined earlier in Step 2 and the specific feature precondition. The resulting sentence can be read as an answer to the question previously presented in the EbA tool table when you noted the feature preconditions – namely, “Do + Stakeholder + Feature precondition?“.<br></br>In Steps 4.1–4.4, the answers to the four questions allow for 256 possible response combinations. All 256 combinations along with their corresponding wording can be found in the method guide under the section “Combined Answers“. If you are using the EbA method tool, the sentence is generated automatically. However, if you are not using the EbA-UIM tool, locate the combination under “Combined Answers“ that matches your responses in Steps 4.1–4.4. Then, append the Stakeholder and the Feature Precondition to this sentence (see Fig. 6). The stakeholder and precondition are exactly the same as  those you entered previously in Step 2.",
      "text2": "If, while reading the sentence, you notice that the wording of the precondition needs to be changed, you can change it in the tool in the same field where the precondition was originally entered – in the “Feature precondition“ column.<br></br>In the EbA method tool, the combined sentence is displayed in two ways: as three separate parts and as one complete, joined sentence. The combined sentence can be hidden if desired.<br></br>Based on the answers given in Step 4, it may turn out that in some cases, we do not have information about our own stakeholder group but do have information about another stakeholder group. The EbA method also values information gathered about other stakeholder groups or from different contexts, as such examples may provide either positive insights or warnings. Additionally, the EbA method considers “Don’t know“ responses important – if it is essential for the analyst to determine the extent to which a specific precondition is met, then a “Don’t know“ answer highlights the need to investigate or test that precondition more thoroughly with users.",
      "example": "Let us remind you that our feature precondition number 1 raised the question: Do customers upload attachments in a file format that the recipients of the files have software programmes to open? After performing steps 1–4 with the input described above, EbA gives the following answer: “There is dissatisfaction with this precondition, but to an extent + customers + upload attachments in a file format that the recipients of the files have software programmes to open”."
    },
    "step7": {
      "header": "Step 7. Make a conclusions and create an action plan",
      "text": "By analysing the preconditions through past examples and reviewing the responses, you have likely already formed ideas about possible improvements to better support those preconditions that currently appear to be insufficiently met. You can write down these ideas directly in the action plan field (see Fig. 7).",
      "text2": "When making suggestions for changes or improvements, it is worth considering that, in addition to modifying the product itself, support activities not directly related to the product solution may sometimes be helpful. For example, creating a tutorial or planning training sessions does not require changes to the product but does involve planning additional actions. If, after creating the action plan, you want to get an overview of what types of activities are needed, use background colours to categorise them:",
      "plan1": "The precondition of the feature is met, that is, “it works”",
      "plan2": "Technology needs to be complemented",
      "plan3": "The solution does not work this way and a different solution has to be found",
      "plan4": "The feature needs a support action",
      "plan5": "The precondition needs to be tested or further analysed",
      "plan6": "Something else",
      "text3": "Before finalising the action plan, it is recommended to review all preconditions mapped under the feature to anticipate and avoid potential conflicts between them.<br></br>If in Step 5 you had to select the most relevant example situation from several given for the same precondition, then base your conclusion and action plan only on the outcome of that most relevant example. You can set the less relevant examples aside.<br></br>How to interpret in EbA combined sentences that indicate stakeholder actions? If a comparable example situation has been found for the precondition – one in which the target group and context (partly) overlap – and the answers to intended use and satisfaction are “Yes,“ “Partly,“ or “No,“ the resulting sentence can be read as a prediction of stakeholder behaviour in the product being developed. You can then decide whether the preconditions for the feature are sufficiently met for the product to function effectively. If so, this can give confidence that no major issues are likely to arise. If not, consider what should be changed or approached differently. If the analysis prompts you to modify any features in the product solution, re-evaluate the relevant preconditions based on the updated aspect.<br></br>If the example situation used for comparison to the precondition applies to different stakeholder group or context, it can still provide valuable insights. For instance, if a different stakeholder has no difficulty meeting the precondition and is satisfied, it is useful to understand what contributed to that positive outcome and whether there is anything we can learn from it.  Conversely, if there are issues with goal achievement and/or satisfaction, this situation could serve as a cautionary example. However, examples involving other stakeholders or contexts do not allow us to make direct conclusions about our own stakeholders and context. In such cases, further analysis or user testing should be planned.<br></br>A “Don't know“ answer gives us a guideline to investigate further the presence of a precondition or to identify it as something that should be tested through user testing.<br></br>Special attention should be paid to situations where purposeful use has been marked as “Yes“, but satisfaction as “No“. This indicates that the stakeholder is acting as intended, but you may want to consider whether something in the system should be changed to prevent dissatisfaction.",
      "example": "In our example, after analysing all five preconditions, the analyst can decide what to do to improve the aspect of dissatisfaction. When offering a solution, it is essential to ensure that it does not conflict with the action plan of the rest of the preconditions of the feature and is consistent with the overall purpose of the product. Without knowing the results of the analysis of the remaining preconditions of this feature, we can decide, at the moment, that to prevent dissatisfaction, the file formats should be limited and customers should be shown which formats are allowed to upload. The example is illustrated in Figure 8."
    },
    "nb": {
      "header": "Using the EbA method, the following should be kept in mind:",
      "text": "<ol><li>The EbA method helps obtain answers regarding those features and assumptions that the analyst considers important to examine – depending on what is entered as a feature and asked as preconditions, both in terms of content and scope.</li><li>The depth of the analysis and the quality of the resulting action plan depend on the analyst’s experience and knowledge, as well as their ability to identify all relevant stakeholder groups and to define the preconditions expected from the stakeholders.</li><li>The validity of the outcome of the analysis depends on the relevance and accuracy of the information used in the analysis.</li><li>EbA does not eliminate the need for user testing, but it helps to design testing tasks more consciously.</li></ol>",
      "text2": "EbA-UIM tool allows you to download the analysis from the main page in Excel or JSON file format. It is recommended to use the JSON format if you plan to send the analysis to another computer or to another person, so that he can continue his analysis in the EbA-UIM tool on his own computer."
    },
    "figures": {
      "1": "assets/Figures/Figure_1.png",
      "2": "assets/Figures/Figure_2.png",
      "3": "assets/Figures/Figure_3.png",
      "4": "assets/Figures/Figure_4.png",
      "5": "assets/Figures/Figure_5.png",
      "6": "assets/Figures/Figure_6.png",
      "7": "assets/Figures/Figure_7.png",
      "8": "assets/Figures/Figure_8.png"
    },
    "figureText": {
      "1": "Figure 1. The EbA framework",
      "2": "Figure 2. The description of the planned solution is divided into features",
      "3": "Figure 3. For each feature it should be decided who are the stakeholders involved in the feature and what are the preconditions",
      "4": "Figure 4. For each precondition, the closest comparable example situation that the stakeholder has experienced in the past should be found",
      "5": "Figure 5. Compare the example with the precondition and evaluate stakeholder behaviour",
      "6": "Figure 6. EbA yields a combined answer as a part of the sentence that describes the precondition situation and combines this with the Stakeholder and Feature precondition",
      "7": "Figure 7. Create an action plan based on the gathered information",
      "8": "Figure 8. An example analysed by the EbA framework"
    }
  },  
  "combinations": {
    "header": "Combined answers",
    "section1Heading": "1. Combinations",
    "section1Text": "In the table below, you can find all the combinations of four questions and four answers. There are 256 combinations in total. One more description has been added to the 256 combinations in case a previously experienced example has not been found for comparison.<br></br>An interpretation is provided for each combination that forms a part of the sentence to which the stakeholder's name is added to the sentence along with the feature precondition (see under label “EbA Method”) . Combined into one sentence, the sentence provides an indication to what extent the stakeholders' actions meet the expectations described in the precondition.<br></br>The combinations are interpreted by Anu Piirisild.<br></br>Variants of combinations and their wording are as follows:",
    "section2Heading": "2. Interpretation of combinations",
    "section2SubHeading": "2.1. How to read the answers of the combinations in the EbA method tool",
    "section2Text": "The results can be read in different ways, according to which one feels more applicable:<br></br><ol><li>Look at the triple column “To what extent the preconditions are met”, where each part of the sentence is listed in a separate column: interpretation of the combination of answers + stakeholder + feature precondition. Such a sentence display is preferred for those who want to read the result as a whole sentence but, at the same time, keep each part of the sentence in a separate column.</li><li>Look at the 3-part sentence joined together. In the EbA method tool, the sentence is located after the triple column “To what extent the preconditions are met”. This sentence display is intended for those who want to read the result as a complete sentence without separating the parts of the sentence. We recommend using this column when the results of the analysis are included in the project documentation and there is a desire to indicate the input for the decisions of the action plan, that is, what the result of the EbA analysis was. In the EbA tool, this sentence column can be hidden.</li><li>Look at the yes-partly-no-don't know answers to the four questions independently, without the interpretation, and the included stakeholder group with the feature precondition, and give your own interpretation of the situation.</li></ol>",
    "section2SubHeading2": "2.2. The principles of creating the formulation for combinations",
    "section2Text2": "When interpreting the combinations, it has been ensured that i) the sentence contains the most essential aspects of the situation and the result gives meaningful information; ii) syntax of the sentence would allow linking to it the stakeholder and feature precondition without changing the wording; iii) the sentence can be used for different types of preconditions; iiii) repeated elements can be used in the sentence.<br></br>The answers are intended to cover different types of assumptions universally, for example, knowledge, awareness, attitudes, skills, emotions, and availability of tools or activities. Therefore, the answers should be read with some abstraction.<br></br>The principles of interpretation and repeated elements used in the phrases are described in the following:",
    "selection1Heading": "2.2.1. The same stakeholder? – interpreting the answers in a sentence",
    "selection1Yes": "In the case of the answer “Yes”, the stakeholder is not mentioned in the sentence because the answer describing the situation gives itself the concept that the information applies to the entire stakeholder group.",
    "selection1Partly": "The answer “Partly” means that the example of the previous experience situation provided for comparison in the EbA method applies to some of the stakeholders' representatives. Therefore, we can draw conclusions about only some stakeholder representatives only. In this case, the word \"some\" is used in the sentence. However, an exception is made if the answer to the purposeful action is “No“ or “Don't know“. In such a case, the answer is generalised to the entire stakeholder group of the situation because even if the smaller number of the whole stakeholder group did not act according to the purpose (answer “No”), or the result of the action was not known (answer “Don't know”), we cannot assume that the action in the created product will be purposeful.",
    "selection1No": "If the answer is “No”, the sentence indicates that “there is a different stakeholder” about whom we have information, which should direct the reader to look at the actions of another stakeholder group to learn from there. However, the sentence reminds us that we don't know about the actual stakeholder, whether the prerequisite is met or not.",
    "selection1DontKnow": "If the answer is “Don't know”, the sentence indicates that “there is a stakeholder” about whom we have information, although this stakeholder cannot be defined at the moment. The answer should direct the reader to define the stakeholder more precisely, if necessary, to learn from the experience there. However, the sentence reminds us that we don't know about the actual stakeholder, whether the precondition is met or not.",
    "selection2Heading": "2.2.2. The same context? – interpreting the answers in a sentence",
    "selection2Yes": "In the case of the answer “Yes”, the context exactness is not mentioned in the sentence because the answer gives itself the concept that there are no differences in context.",
    "selection2Partly": "The answer “Partly” indicates that the information applies to a “slightly different context”.",
    "selection2No": "If the answer is “No”, the sentence uses the expression “in another context”, which should direct the reader to look at these other contexts to take a good or a warning example from there.",
    "selection2DontKnow": "If the answer is “Don't know”, the sentence uses the expression “in an unknown context”, which should direct the reader to learn more about this unknown context to take a good or a warning example from there.",
    "selection3Heading": "2.2.3. Purposeful action? – interpreting the answers in a sentence",
    "selection3Yes": " In the case of the answer “Yes”, the outcome of the action is not mentioned in the sentence if the stakeholder is the same (answer “Yes”), or partly the same (answer “Partly”). It is expressed this way because the answer itself gives the concept that the action outcome is purposeful. If the answer to the question “The same stakeholder?” is “No”, or “Don't know”, the action outcome is shown in the sentence as purposeful.",
    "selection3Partly": "The answer “Partly” is expressed in the sentence with the wording “to an extent”, which means that the scope, quality, or activity of the action meets the expectations only partially.",
    "selection3No": "If the answer is “No”, the sentence uses the expression “the action outcome is incorrect”. If the answer is “no”, the sentence also contains a reminder that based on the current information, we cannot assume that the actions will be purposeful while using the new product. This, in turn, means that the purposefulness of the stakeholder's actions must either be analysed further or prepared for testing.",
    "selection3DontKnow": "The answer “Don't know” is expressed in the sentence with the wording “the action outcome is unknown”. If the outcome of the action is not known, the sentence also contains a reminder that, based on the current information, we cannot assume that the actions will be purposeful while using the new product. This, in turn, means that the purposefulness of the stakeholder's actions must either be analysed further or prepared for testing.",
    "selection4Heading": "2.2.4. Stakeholder satisfaction? – interpreting the answers in a sentence",
    "selection4Yes": " In the case of the answer “Yes”, satisfaction is not mentioned in the sentence because the answer describing the situation gives the concept that there is no problem with satisfaction.",
    "selection4Partly": "The answer “Partly” is expressed in the sentence with the wording “there is somewhat dissatisfaction with this precondition”, which means that there are some problems with satisfaction.",
    "selection4No": "If the answer is “No”, the sentence uses the expression “there is dissatisfaction with this precondition”. This information should guide the reader to find a different solution with which the probability of satisfaction would be higher.",
    "selection4DontKnow": "The answer “Don't know” is expressed in the sentence with the wording “satisfaction with this precondition is unknown”. This information should guide the reader to determine satisfaction through further analysis or testing with users."
  },
  "example": {
    "header": "Example",
    "area": "A larger-scale fictional example, where the EbA method has been applied to analyze a solution, can be found on the homepage under the project name “Example ENG”. The input for the fictional example is described on this page.",
    "section1Heading": "Input for the analysis of the project “Example ENG”",
    "section1Text": "Customers of the hair salon LAHE have previously had the option to book appointments either through the booking system on the website or by calling the salon by phone.  The salon has no administrator because it is a small salon, and they try to keep the costs low. Salon hairdressers feel that answering the phone while serving a customer is impolite. Hairdressers favor when customers book their appointments online.<br></br>Hairdressers want to introduce an answering machine that activates if no one answers the phone within three seconds. The message of the answering machine directs clients to book online. The same suggestion applies to the need to change the booking.<br></br>Almost a third of the bookings at this hair salon are made by phone. Hairdressers at the salon say the reservations by phone are mainly made by older people, who are estimated to be over 65 years old. Younger customers dominate among those who book online, but older customers are presented as well.  It is unknown whether the elderly customers made the online booking independently or if they used somebody's help.<br></br>Hairdressers have previously received two types of feedback from their elderly customers about booking online: i) customers do not feel confident when booking on the homepage; ii) customers could not find where to book on the website.<br></br>It is decided that, in addition to the answering machine, the functionality of making a reservation on the website must also be improved so that it will be easy for older adults to book there. The changes by introducing an answering machine and improving the functionality on the homepage must not scare any customers away.<br></br>The proposed solution – containing both previous and changed elements – is the following:<ol><li>When clients call the hair salon within business hours, after three seconds of inviting tones, the answering machine turns on, and a voicemail message informs that all hairdressers are currently busy and suggests to open the hair salon's homepage lahe.ee and make a booking or change the booking from there, or call later.</li><li>The BOOKING ONLINE button is moved to the very first place in the menu bar. The background color of the BOOKING ONLINE button is changed to stand out from the rest of the menu bars. Since the menu buttons and text will be made more prominent, more space is needed for the menu. Therefore, the NEWS menu will be left out (there are very few readers on the news page. Therefore, there is no point in keeping it anyway). All website content is published in one language (national language).</li><li>After clicking on the BOOK ONLINE button, the web page displays an encouraging text, which confirms that the customer will be guided when booking online; just need to fill in the fields and follow the instructions to the end until the message “Your booking is confirmed”.</li><li>Below the encouraging text, the web page displays a list of primary services: women's hairdresser, men's hairdresser, children's hairdresser, and change reservation. By choosing either a women's, men's, or children's hairdresser, the system opens the list of possible services, while the standard options for elderly customers are raised to the top of the list.</li><li>By changing the reservation, the web page displays the following text and additional fields: first name, last name, phone number, or email, and a free text field where customers can write the reservation time and choose a new time.  At the end, there is a “Send” button. After clicking the “Send” button, the system displays the following notification: the information has been sent, and the salon will take contact.</li><li>After the customer has chosen a service (women's, men's, or children's hairdresser), the system asks for the hair length (short, shoulder-length, long).</li><li>After the customer has selected the hair length, the system displays the duration and price of the service, as well as the fields “Choose a hairdresser”, and “Choose a date”.<br></br>7.1. After the client has selected the hairdresser's name from the drop-down menu, the system displays a side-by-side calendar view, where the free dates of this hairdresser are displayed with a distinctive background color, and the rest of the dates are inactive. If the customer selects the name of another hairdresser, the system will make the free dates of the chosen hairdresser active.<br></br>7.2.  When the customer selects by date, the system displays the available dates to the customer with a distinctive background tone. When the customer clicks on the date, the system displays the start time of the service. If the customer changes the date, the system will show the available hours for the selected date. Once the customer has chosen the start time of the service, the system displays the hairdresser's name and the button “Continue booking”.<br></br></li><li>After the customer has clicked “Continue booking”, the system will show the customer a summary of the previously made booking and ask to fill in the fields: first name, last name, e-mail, phone, and “Confirm booking”. The customer clicks “Confirm booking”, but if any fields are not filled in, the system marks this place in red and displays the text: “Please fill out all required fields.”</li><li>After the customer has confirmed the reservation, the system displays the following notification to the customer: “Your appointment has been successfully booked.  We will send you a reminder by e-mail a day before. Please let us know if you need to reschedule by clicking “Change reservation”.”</li><li>One day before the service, the system sends a reminder to the e-mail specified by the customer with information about the service.</li></ol><i>The company LAHE and its business needs for the EbA analysis used as an example (see project “Example ENG” on homepage of the EbA-UIM tool) is fictional. The validation data is planned to be collected from shared knowledge and discussions with hair salon employees.</li>"
  },  
  "about": {
    "header": "About",
    "area": "Information about the EbA method and the EbA-UIM tool<br></br>Copyright<br></br>Contacts",
    "section1Heading": "EbA Method",
    "section1Text": "The Experience-based Analysis (EbA) method was developed to make the development of digital products and services more cost-effective. The EbA method creates effectiveness primarily by helping to assess, already in the early analysis phase of product development, whether the proposed solution is likely to function as intended from the perspective of user behaviour and habits, and what potential risks may arise. The earlier changes can be made, the more cost-efficient the development process will be. In addition, the EbA method supports efficiency by making it possible to analyse the product without creating a prototype, and by enabling those responsible for requirements analysis to perform usability assessments themselves, without necessarily relying on specialised experts. Furthermore, EbA enables a broader analysis of usability – going beyond the interaction between the system and the user.<br></br>In the EbA method, conclusions about usability are based on what the product solution designer assumes from end users and related parties (hereafter: stakeholders), and on how these stakeholders have previously met such preconditions, as well as their level of satisfaction in doing so. Based on the assessment of prior experience, the EbA method provides an answer that indicates how well stakeholders possess the knowledge, skills, habits or resources that the product solution designer considers necessary for the product’s success. These answers help the person conducting the analysis determine whether the preconditions are sufficiently met for the solution to function successfully, and support the planning of further actions. The description and guidance for using the EbA method can be found in the “EbA Method Guide“.<br></br>The author of the EbA method is Anu Piirisild, who first described the method in her master's thesis in 2021 (Piirisild A.  Analogy-based technology effectiveness prediction model and tool. Master’s thesis, University of Tartu (2021). https://hdl.handle.net/10062/72631). The author of the EbA method is continuing to research and refine it during her doctoral studies at the University of Tartu. The method is currently in the PoC-phase (Proof-of-Concept). In 2024, a comparison between the EbA method and user testing was conducted to determine the extent to which the EbA method identifies the same usability insights typically obtained through user testing. The results are presented in the following article: Experience-Based Analysis (EbA) In: Piirisild A., Perandrés Gómez A., Taveter K. “A New Usability Inspection Method: Experience-Based Analysis (EbA)“ In: Mendez, D., Moreira, A. (eds) Requirements Engineering: Foundation for Software Quality. REFSQ 2024. Lecture Notes in Computer Science, vol 14588. Springer, Cham. DOI 10.1007/978-3-031-57327-9_5.<br></br>Your feedback on your experience with the EbA method and tool would be highly appreciated. Please send your comments to the following email address: <a href='mailto:anu.piirisild@ut.ee'>anu.piirisild@ut.ee</a>.",
    "section2Heading": "EBA-UIM tool for the EbA method",
    "section2Text": "The <b>EBA-UIM</b> tool was created to make it easier to apply the Experience-Based Analysis (EbA) method. It helps structure the information and automatically generates descriptions that indicate the usability of the product or e-service being developed.<br></br>The tool is available in Estonian and English. In the tool, you can currently create projects and conduct analyses. From the home page, you can download projects and also upload them as JSON files. In the downloaded Excel file, you can customise the analysed information according to your needs – for example, by hiding unnecessary columns for reporting, emphasising text, and using background colours to highlight fields. When using the EbA method and the EbA-UIM tool for the first time, we recommend exploring the analysis process and method’s capabilities with a sample project. You can download the sample file “Example_ENG.json“ from the same repository link where you downloaded the EbA-UIM application. The Example_ENG.json file can be uploaded directly from the application’s first page, via the “New project“ section. The context of the sample project is described in the tool under “EbA Method Guide“ > “Example“.<br></br>The <b>EBA-UIM tool</b> is a desktop application that works offline and stores all data locally on the user’s device.",
    "section4Heading": "Copyright (c) 2024 University of Tartu",
    "section4Text": "Any person who acquires a copy of this Software and related documentation files (“Software“) is hereby granted a free license to use and copy the Software, and the persons to whom the Software is supplied are permitted to do so, subject to the following conditions:<ul><li>This copyright notice and this permission notice shall be included in all copies of the Software.</li><li>Only the use of the Software is allowed, and all other activities are prohibited (e.g. modifying the Software etc.).</li><li>Software refers to both the software itself and the methods used in the software.</li></ul>THE SOFTWARE IS PROVIDED “AS IS“, WITHOUT WARRANTY OF ANY KIND. IN NO EVENT SHALL LICENSOR BE LIABLE FOR DAMAGES, INCLUDING ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS OR SAVINGS, BUSINESS INTERRUPTION OR OTHER COMMERCIAL DAMAGE OR LOSS, ARISING FROM THE USE OF THE SOFTWARE.",
    "section3Heading": "Accessiblity",
    "section3Text": "<b>Keyboard navigation.</b> The application allows complete keyboard navigation. The Tab key can be used to move forward, and the Shift + Tab key combination can be used to move backward. Interactive elements (such as buttons and menus) can be activated as needed with either the Enter key or the Space key. To navigate between tabs (like in the 'EbA Method Guide' page), you should use the left arrow and right arrow keys. If the tab system has two levels, you can switch between levels using the Tab key.\nWithin a project table view, there are two buttons that can be activated using special keyboard shortcuts. The first is the 'Up' button, which can be activated without moving focus to it by using the Ctrl + up arrow combination. Additionally, there is a 'Hide Column' button to hide the duplicate column 'To what extent the preconditions are met', which can be activated by pressing Ctrl + H. These two buttons can also be used one at a time, with up to a three-second interval.<br></br><b>Zooming in and out.</b> It is also possible to zoom in and out within the application using each person’s individually configured keyboard shortcut (such as Ctrl and '+' or Ctrl and '-' combination, depending on the operating system configuration).<br></br><b>Usage of screen reader.</b> The application supports screen reader usage and has been tested with JAWS 2025 software. Although the application is not specifically designed for users who rely entirely on a screen reader, it provides support that enables essential navigation and content reading.",
    "section5Heading": "Developers of the EBA-UIM Tool",
    "section5Text": "The EBA-UIM application was developed by Karl Olaf Kuldmaa, Iris Kreinin, Sander Põldma, Rahel Pettai, Gerdo Germann, and Timo Kaasik, bachelor's students of Informatics at the University of Tartu. The EBA-UIM application is an enhanced version of the initial prototype of the EbA method tool,  originally created by Anu Piirisild (Piirisild A. Tool for the experience-based analysis (EBA) method (2024). https://doi.org/10.23673/re-453).<br></br>In the first phase of development, Karl Olaf Kuldmaa created the application's back-end, database, and front-end. (Kuldmaa K. O. Development of an Application Program for the “Experience-based Analysis Method“. Bachelor’s thesis, University of Tartu (2024). https://thesis.cs.ut.ee/4cc62aee-6f24-4e9d-baac-9992975cf539). Iris Kreinin developed the front-end and designed the user interface of the application (Kreinin I. Designing a User interface for the “Experience-based Usability Analysis Method“ Application. Bachelor’s thesis, University of Tartu (2024). https://thesis.cs.ut.ee/bb6dc45d-5375-47bd-8fde-e013785b0bb3).<br></br>In the second phase of development, Sander Põldma enhanced the functionality of the application's back-end, optimised the display of data tables in the front-end, and made the application platform-independent using the Electron framework. In addition, Sander Põldma managed the project and coordinated the teamwork (Põldma S. Further Development and Team Leadership for the “Experience-Based Analysis Method“ Application. Bachelor’s thesis, University of Tartu (2025). https://thesis.cs.ut.ee/9de136ec-d50d-4a41-a3bd-2dab54a6f2fe).\nRahel Pettai conducted a requirements analysis for the second phase of development from the perspective of digital accessibility, designed the new elements, implemented the requirements in the front-end, and made improvements to enhance the application's compliance with a broader set of digital accessibility criteria (Pettai R. Further Development of User Interface and Digital Accessibility for the “Experience-based Usability Analysis Method“ Application. Bachelor’s thesis, University of Tartu (2025). https://thesis.cs.ut.ee/39055e1b-18d3-4fd0-9e49-d0ef4f57ad42).\nGerdo Germann was responsible for ensuring that the Electron-based application functions correctly on macOS and Linux operating systems. In addition, Gerdo Germann carried out testing for the developments made in the second phase and conducted end-user testing (Germann G. “Experience-based Analysis method“ desktop application testing and macOS optimisation. Bachelor’s thesis, University of Tartu (2025). https://thesis.cs.ut.ee/6137d011-67a5-421f-a335-a9c644a56dad).\nTimo Kaasik helped analyse the requirements for the second phase and worked on improving the front-end. \nAnu Piirisild created the EbA method guide, explanatory texts, and the example project.",
    "contact": "Contacts",
    "address": "Anu Piirisild<br></br><a href='mailto:anu.piirisild@ut.ee'>anu.piirisild@ut.ee</a><br></br><br></br>University of Tartu<br></br>Institute of Computer Science<br></br>Narva mnt 18<br></br>51009 Tartu, Estonia",
    "overview": "The next three topics give an overview of the page content"
  },
  "backToTop": {
    "buttonLabel": "TOP",
    "ariaLabel": "Button for scrolling back to the top. Press Enter, Space, or use Ctrl + Up Arrow to activate.",
    "ariaLabel2": "Button for navigating back to top is now available. Press Enter, Space, or use Ctrl + Up Arrow to activate."
  },
  "noExampleModal": {
    "title": "Confirm No Situation",
    "message": "Are you sure you want to mark this as 'No situation'? This will reset all selections for this example.",
    "confirm": "Confirm",
    "cancel": "Cancel"
  },
  "noExampleNotification": {
    "message": "The example has been marked as 'No situation'"
  },
  "hidePanels": {
    "hide": "Hide",
    "unhide": "Show panels",
    "ariaLabel": "Button to toggle visibility of project tabs. Press Enter, Space, or use Ctrl + Up Arrow to activate."
  },
  "hideColumn": {
    "hide": "Hide column (Ctrl+H)",
    "show": "Show column (Ctrl+H)"
  },
  "colorPicker": {
    "change": "Categorise action plan",
    "close": "Hide"
  },
  "colorPickerExplanation": {
    "green": "The precondition of the feature is met, that is, \"it works\"",
    "orange": "Technology needs to be complemented",
    "red": "The solution does not work this way and a different solution has to be found",
    "yellow": "The feature needs a support action",
    "blue": "The precondition needs to be tested or further analysed",
    "grey": "Something else",
    "default": "No category"
  },
  "prioritizationNotice": {
    "message": "Multiple situations have been added under this precondition. They can be prioritized by using the checkbox ✅.",
    "title": "Prioritizing opportunity"
  },
  "conclusion": {
    "changedNotice": "The previous combination of answers has been changed. If necessary, update the action plan."
  },
  "skipButton": {
    "skipToTable": "Skip to main table content"
  },
  "confirmModal": {
    "deleteRowTitle": "Delete row",
    "deleteRowMessage": "Are you sure you want to delete this row?",
    "deleteExampleTitle": "Delete situation",
    "deleteExampleMessage": "Are you sure you want to delete this situation?",
    "deleteFeatureTitle": "Delete feature",
    "deleteFeatureMessage": "Are you sure you want to delete this feature?",
    "deletePreconditionTitle": "Delete precondition",
    "deletePreconditionMessage": "Are you sure you want to delete this precondition?"
  },
  "paginationButton": {
    "previous": "Previous",
    "next": "Next"
  },
  "pagination": {
    "of": "Total",
    "page": "Page"
  },
  "loading": {
    "spinner": "Loading content"
  },
  "dropdownMenu": {
    "name": "Open dropdown menu"
  },
  "questionnaires": "Questionnaires",
  "et": "EST",
  "en": "ENG"
}
